app/views/shared/show/_card-voted-closed.html.erb

SELECT  "nominees".* FROM "nominees" WHERE "nominees"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
---
<div class="card-voted top-card">
  <%= cl_image_tag Nominee.find(id=@answer[0].nominee_id).photo.key, height: 373, width: 280, crop: :fill, class: 'photo-nominee' %>

SELECT  "nominees".* FROM "nominees" WHERE "nominees"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
---
      <p class="label-infos-title">Tu as voté pour</p>
      <p class="nominee-infos"><%= Nominee.find(@answer[0].nominee_id).name %> <span class="infos-title-real">- <%= Nominee.find(@answer[0].nominee_id).real %></span></p>

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = $1 AND "answers"."category_id" = $2  [["user_id", 7], ["category_id", 59]]
---
        <td><%= user.prenom %> <%= user.nom %> </td>
        <% if user.answers.where(category_id: @category.id)[0] == nil %>
          <td>En attente de la récompense</td>
        <% elsif user.answers.where(category_id: @category.id)[0].nominee.winner == true %>

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = $1 AND "answers"."category_id" = $2  [["user_id", 7], ["category_id", 59]]
---
          <% user.answers.where(category_id: @category.id)[0].points_earned = number %>
        <% elsif user.answers.where(category_id: @category.id)[0].nominee.winner == false %>