app/controllers/answers_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
SELECT  "nominees".* FROM "nominees" WHERE "nominees"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
INSERT INTO "answers" ("category_id", "nominee_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 59], ["nominee_id", 161], ["created_at", "2020-04-14 08:46:08.526904"], ["updated_at", "2020-04-14 08:46:08.526904"], ["user_id", 7]]
---
  def create
    @category = Category.find(params[:category_id])
    @nominee = Nominee.find(params[:nominee_id])
    @user = current_user
    if @nominee.winner == true
      @answer = Answer.new(category_id: @category.id, nominee_id: @nominee.id, user_id: @user.id, points_earned: @category.points)
      @user.stock += @category.points
      @user.save!