app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
SELECT "nominees".* FROM "nominees" WHERE "nominees"."category_id" = $1  [["category_id", 59]]
SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = $1 AND "answers"."category_id" = $2  [["user_id", 2], ["category_id", 24]]
SELECT "users".* FROM "users"
---
  def show
    @category = Category.find(params[:id])
    @nominees = Nominee.where(category_id: params[:id])
    @answer = Answer.where(user_id: current_user.id, category_id: params[:id])
    @users = User.all

SELECT COUNT(*) FROM "answers" WHERE "answers"."category_id" = $1  [["category_id", 59]]
---
    def set_answers_counter
      @answers_count = Answer.where(category_id: params[:id]).count