app/controllers/pages_controller.rb

  def home
    @home_page = true
    @category = Category.first
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]